#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

module.rds.random_password.master_password: Refreshing state... [id=none]
data.aws_iam_role.name: Reading...
module.eks.data.aws_vpcs.selected: Reading...
module.rds.aws_secretsmanager_secret.rds_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:672154718861:secret:database-credentials-oAgSb7]
module.cognito.aws_secretsmanager_secret.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:672154718861:secret:lambda-auth-credentials-flIRq2]
module.rds.aws_db_instance.mssql-techlanches-instance: Refreshing state... [id=db-G5HLCNMHA63BDOBQ5DGZ2POCRM]
module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool: Refreshing state... [id=us-east-1_sC3N8bSbk]
module.dynamoDb.aws_dynamodb_table.pagamentos: Refreshing state... [id=pagamentos]
module.eks.data.aws_iam_role.name: Reading...
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
module.eks.data.aws_iam_role.name: Read complete after 0s [id=LabRole]
module.eks.data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
module.eks.data.aws_subnets.selected: Reading...
module.rds.aws_secretsmanager_secret_version.rds_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:672154718861:secret:database-credentials-oAgSb7|terraform-20240429214929307500000005]
module.eks.data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
module.eks.data.aws_subnet.selected["subnet-0f1deffe23691cbea"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0601f7a24b959af3a"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0f23f4d26e5ef5c04"]: Reading...
module.eks.data.aws_subnet.selected["subnet-03f7ef57b189f4875"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0d6f4613a622a09b7"]: Reading...
module.eks.data.aws_subnet.selected["subnet-086b6c0147233cbbd"]: Reading...
module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client: Refreshing state... [id=31vi18hrcel7eq9f1bfmn5i0q3]
module.cognito.aws_secretsmanager_secret_version.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:672154718861:secret:lambda-auth-credentials-flIRq2|terraform-20240429213904405900000003]
module.eks.data.aws_subnet.selected["subnet-0601f7a24b959af3a"]: Read complete after 0s [id=subnet-0601f7a24b959af3a]
module.eks.data.aws_subnet.selected["subnet-086b6c0147233cbbd"]: Read complete after 0s [id=subnet-086b6c0147233cbbd]
module.eks.data.aws_subnet.selected["subnet-0f23f4d26e5ef5c04"]: Read complete after 0s [id=subnet-0f23f4d26e5ef5c04]
module.eks.data.aws_subnet.selected["subnet-0d6f4613a622a09b7"]: Read complete after 0s [id=subnet-0d6f4613a622a09b7]
module.eks.data.aws_subnet.selected["subnet-03f7ef57b189f4875"]: Read complete after 0s [id=subnet-03f7ef57b189f4875]
module.eks.data.aws_subnet.selected["subnet-0f1deffe23691cbea"]: Read complete after 0s [id=subnet-0f1deffe23691cbea]
module.eks.aws_eks_cluster.eks-techlanches: Refreshing state... [id=eks-techlanches]
module.eks.aws_security_group.eks-sg: Refreshing state... [id=sg-0a46c492d07c86c6f]
module.eks.data.aws_security_group.eks-sg: Reading...
module.eks.aws_eks_node_group.techlanches-node: Refreshing state... [id=eks-techlanches:techlanches-node]
module.eks.data.aws_security_group.eks-sg: Read complete after 0s [id=sg-02b76410128600fba]
module.eks.aws_security_group_rule.allow_eks_to_rds: Refreshing state... [id=sgrule-1810768943]
module.eks.aws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=eks-techlanches:aws-ebs-csi-driver]
module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=eks-techlanches:vpc-cni]
module.eks.aws_eks_addon.core_dns: Refreshing state... [id=eks-techlanches:coredns]
module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=eks-techlanches:kube-proxy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "tech_lanches_clientes_pool_client" {
        id                                            = "31vi18hrcel7eq9f1bfmn5i0q3"
        name                                          = "pool-client"
        # (16 unchanged attributes hidden)
    }

  # module.cognito.aws_secretsmanager_secret_version.lambda_auth_credentials will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "lambda_auth_credentials" {
        id             = "arn:aws:secretsmanager:us-east-1:672154718861:secret:lambda-auth-credentials-flIRq2|terraform-20240429213904405900000003"
        # (5 unchanged attributes hidden)
    }

  # module.eks.aws_eks_node_group.techlanches-node will be created
  + resource "aws_eks_node_group" "techlanches-node" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks-techlanches"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "c3.xlarge",
        ]
      + node_group_name        = "techlanches-node"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::672154718861:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03f7ef57b189f4875",
          + "subnet-0601f7a24b959af3a",
          + "subnet-086b6c0147233cbbd",
          + "subnet-0f1deffe23691cbea",
          + "subnet-0f23f4d26e5ef5c04",
        ]
      + tags_all               = (known after apply)
      + version                = "1.29"

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }
    }

  # module.rds.aws_secretsmanager_secret_version.rds_credentials will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "rds_credentials" {
        id             = "arn:aws:secretsmanager:us-east-1:672154718861:secret:database-credentials-oAgSb7|terraform-20240429214929307500000005"
        # (5 unchanged attributes hidden)
    }

  # module.rds.random_password.master_password will be updated in-place
  ~ resource "random_password" "master_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @nsosoares, Action: `pull_request`*